In [2]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [12]:
df = pd.read_csv('churn.csv')
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 17 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   RowNumber             10000 non-null  int64
 1   CustomerId            10000 non-null  int64
 2   Surname               9914 non-null   object
 3   CreditScore           9963 non-null   float64
 4   Geography             9963 non-null   object
 5   Gender                9963 non-null   object
 6   Sex                   9805 non-null   float64
 7   Age                   9963 non-null   float64
 8   CurrentWorkingStatus  9963 non-null   float64
 9   Tenure                9963 non-null   float64
 10  Balance               9963 non-null   float64
 11  NumOfProducts         9859 non-null   float64
 12  ComplaintsLodged      9963 non-null   float64
 13  HasCrCard             9963 non-null   float64
 14  IsActiveMember        9963 non-null   float64
 15  EstimatedSalary       9896 non-null   object
 16  Exited                10000 non-null  object
dtypes: float64(10), int64(2), object(5)
memory usage: 1.3+ MB
None

In [14]:
df.head(10)

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Sex,Age,CurrentWorkingStatus,Tenure,Balance,NumOfProducts,ComplaintsLodged,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619.0,France,Female,1.0,42.0,1.0,2.0,0.00,1.0,1.0,1.0,1.0,101348.88,Yes
1,2,15647311,Hill,608.0,Spain,Female,1.0,41.0,1.0,1.0,83807.86,1.0,0.0,0.0,1.0,112542.58,No
2,3,15619304,Onio,502.0,France,Female,1.0,42.0,1.0,8.0,159660.80,3.0,1.0,1.0,0.0,113931.57,Yes
3,4,15701354,Boni,699.0,France,Female,1.0,39.0,1.0,1.0,0.00,2.0,0.0,0.0,0.0,?,No
4,5,15737888,Mitchell,850.0,Spain,Female,1.0,43.0,1.0,2.0,125510.82,1.0,0.0,1.0,1.0,79084.1,No
5,6,15574012,Chu,645.0,Spain,Male,0.0,44.0,1.0,8.0,113755.78,2.0,1.0,1.0,0.0,149756.71,Yes
6,7,15592531,Bartlett,822.0,France,Male,0.0,-1.0,1.0,7.0,0.00,2.0,0.0,1.0,1.0,10062.8,No
7,8,15656148,Obinna,376.0,Germany,Female,1.0,29.0,1.0,4.0,115046.74,4.0,1.0,1.0,0.0,119346.88,Yes
8,9,15792365,He,501.0,France,Male,0.0,44.0,1.0,4.0,142051.07,2.0,0.0,0.0,1.0,74940.5,No
9,10,15592389,H?,684.0,France,Male,0.0,27.0,1.0,2.0,134603.88,1.0,0.0,1.0,1.0,71725.73,No

In [15]:
print(df['Tenure'].unique())

[ 2.  1.  8.  7.  4.  6.  3. 10.  5.  9. nan  0.]

Question 1
what is the proportion of customers who exited and stopped using the banking services?

In [4]:
#answer 
print(df['Exited'].describe())
print(df['Exited'].value_counts())

count     10000
unique        2
top          No
freq       7963
Name: Exited, dtype: object
No     7963
Yes    2037
Name: Exited, dtype: int64

There is 2037 people exited from the data base

Question 2
The dataset may include irrelevant and redundant varibles. What varibles did you include in the analysis and what were their roles and measurement leve lset? Justify your choice

In [5]:
df.isnull().sum()

RowNumber                 0
CustomerId                0
Surname                  86
CreditScore              37
Geography                37
Gender                   37
Sex                     195
Age                      37
CurrentWorkingStatus     37
Tenure                   37
Balance                  37
NumOfProducts           141
ComplaintsLodged         37
HasCrCard                37
IsActiveMember           37
EstimatedSalary         104
Exited                    0
dtype: int64

In [6]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 17 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   RowNumber             10000 non-null  int64
 1   CustomerId            10000 non-null  int64
 2   Surname               9914 non-null   object
 3   CreditScore           9963 non-null   float64
 4   Geography             9963 non-null   object
 5   Gender                9963 non-null   object
 6   Sex                   9805 non-null   float64
 7   Age                   9963 non-null   float64
 8   CurrentWorkingStatus  9963 non-null   float64
 9   Tenure                9963 non-null   float64
 10  Balance               9963 non-null   float64
 11  NumOfProducts         9859 non-null   float64
 12  ComplaintsLodged      9963 non-null   float64
 13  HasCrCard             9963 non-null   float64
 14  IsActiveMember        9963 non-null   float64
 15  EstimatedSalary       9896 non-null   object
 16  Exited                10000 non-null  object
dtypes: float64(10), int64(2), object(5)
memory usage: 1.3+ MB
None

In [10]:
df['Gender'].unique()

array(['Female', 'Male', nan], dtype=object)

In [11]:
df['Sex'].unique()

array([ 1.,  0., nan])

In [18]:
#change Gender into binary 0/1 varible
Gender = {'Male':0, "Female": 1}
df['Gender'] = df['Gender'].map(Gender)

In [19]:
df['Gender'].value_counts()

0.0    5439
1.0    4524
Name: Gender, dtype: int64

In [20]:
df['Geography'].value_counts()

France     4963
Germany    2484
Spain      2457
FR           35
ES           13
DE           11
Name: Geography, dtype: int64

In [33]:
df.drop(['RowNumber', 'CustomerId', 'Surname',''], axis=1, inplace=True)

In [37]:
# impute missing values in DemAge with its mean
df['Age'].fillna(df['Age'].mean(), inplace=True)

In [46]:
df['Gender'].unique()

array([1., 0.])

In [45]:
df.dropna(subset = ["Gender"], inplace=True)

In [ ]:
print(df.groupby(['Exited'])['Sex'].mean())